In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
df1 = DataFrame({'Value1':[1,2,3,4,5,6],'Value2':[7,8,9,10,11,12],'Another':['A','B','A','A','B','C']})
df1

   Value1  Value2 Another
0       1       7       A
1       2       8       B
2       3       9       A
3       4      10       A
4       5      11       B
5       6      12       C

In [5]:
df1.index.names = ['Numbers']
df1.columns.names = ['Values']
df1

Values   Value1  Value2 Another
Numbers
0             1       7       A
1             2       8       B
2             3       9       A
3             4      10       A
4             5      11       B
5             6      12       C

In [7]:
df1['Value1']

Numbers
0    1
1    2
2    3
3    4
4    5
5    6
Name: Value1, dtype: int64

In [8]:
df1['Value1'].groupby(df1['Another']) #group by for one column based on another column. 
# Now groups are formed based on similar values in another column.
# the above will create a groupby object

In [12]:
df1['Value1'].groupby(df1['Another']).sum() # performs mean on the formed group's values (for Value1)
# we have other functions that we can perform on the grouped values of columns such as mean(),count(),max(),min(),size()

Another
A    8
B    7
C    6
Name: Value1, dtype: int64

In [28]:
df1.groupby('Another')[['Value1']].sum() # another way of grouping by a column on another column.
# This create a dataframe instead of series

Values   Value1
Another
A             8
B             7
C             6

In [14]:
# we can also group the entire dataframe based on a column
df1.groupby(df1['Another']).mean() # groups all columns as an average based on another column

Values     Value1     Value2
Another
A        2.666667   8.666667
B        3.500000   9.500000
C        6.000000  12.000000

In [15]:
# we can also groupby multiple keys
df2 = DataFrame({'Value1':[1,2,3,4,5,6],'Value2':[7,8,9,10,11,12],'Another1':['A','B','A','A','B','C'],
                 'Another2':['Cold','Mild','Hot','Hot','Mild','Cold']})
df2

   Value1  Value2 Another1 Another2
0       1       7        A     Cold
1       2       8        B     Mild
2       3       9        A      Hot
3       4      10        A      Hot
4       5      11        B     Mild
5       6      12        C     Cold

In [19]:
df2.groupby(['Another1','Another2']).max() # all columns are grouped based on the combinations of first key with the second key
#then operations are applied.

                   Value1  Value2
Another1 Another2
A        Cold           1       7
         Hot            4      10
B        Mild           5      11
C        Cold           6      12

In [22]:
# we can fetch the name of the group formed and the group itself by performing iteration
for name,group in df2.groupby('Another1'): # A group's set will come in the first iteration, B's group in second.. and so on
    print(name)
    print(group)
    print('\n')
# always imagine calculations being performed on the subtables as below after grouping them.

A
   Value1  Value2 Another1 Another2
0       1       7        A     Cold
2       3       9        A      Hot
3       4      10        A      Hot


B
   Value1  Value2 Another1 Another2
1       2       8        B     Mild
4       5      11        B     Mild


C
   Value1  Value2 Another1 Another2
5       6      12        C     Cold

In [24]:
# we can also do the above for multiple keys
for (name1,name2),group in df2.groupby(['Another1','Another2']):
    print(name1,name2)
    print(group)
    print('\n')
# the below is how table is divided when grouping is done based on two columns

A Cold
   Value1  Value2 Another1 Another2
0       1       7        A     Cold


A Hot
   Value1  Value2 Another1 Another2
2       3       9        A      Hot
3       4      10        A      Hot


B Mild
   Value1  Value2 Another1 Another2
1       2       8        B     Mild
4       5      11        B     Mild


C Cold
   Value1  Value2 Another1 Another2
5       6      12        C     Cold

In [26]:
# we can convert a groupby object to a dictionary and access the above tables by passing keys
my_dict = dict(list(df2.groupby('Another1')))
my_dict

{'A':    Value1  Value2 Another1 Another2
 0       1       7        A     Cold
 2       3       9        A      Hot
 3       4      10        A      Hot,
 'B':    Value1  Value2 Another1 Another2
 1       2       8        B     Mild
 4       5      11        B     Mild,
 'C':    Value1  Value2 Another1 Another2
 5       6      12        C     Cold}

In [27]:
my_dict['B']

   Value1  Value2 Another1 Another2
1       2       8        B     Mild
4       5      11        B     Mild

# groupby dictionaries and series

In [34]:
dict1 = {'Value1':'First','Value2':'Second','Another1':'First','Another2':'Second'}
df2

   Value1  Value2 Another1 Another2
0       1       7        A     Cold
1       2       8        B     Mild
2       3       9        A      Hot
3       4      10        A      Hot
4       5      11        B     Mild
5       6      12        C     Cold

In [36]:
df2.groupby(dict1,axis=1).sum() # by default grouping is done by rows, now we want by columns so axis = 1

   First  Second
0      1       7
1      2       8
2      3       9
3      4      10
4      5      11
5      6      12

In [ ]:
# we can also group by length of an index(in case the index is a string)
# dummyDF.groupby(len).sum() # performs sum of values which are grouped based on lengths of indexes
# or
# dummyDF.groupby([len,'another']).sum()

In [ ]:
# refer to video ending of 43rd lecture to see how hierarchy index can be created through another way.